START_TEXT = '''
✨ Привіт!
Я допоможу Вам дізнатися актуальний курс іноземних валют Національного банку України.
🌍 Вибери валюту нижче, щоб дізнатися її курс:
'''

CURRENCY_NOT_FOUND_TEXT = '''
❗ На жаль, курс валюти {currency} наразі не доступний. Спробуйте ще раз пізніше.
'''

ENTER_AMOUNT_TEXT = '''
📈 Курс валюти {currency}:
💰 {rate}₴

🪙 Введіть суму в гривнях, і я розрахую еквівалент в іноземній валюті:
'''

EXCHANGE_RATE_TEXT = '''
💸 Ваша сума: {amount}₴
🌍 Еквівалент в валюті {currency}: {converted_amount}
📈 Актуальний курс: {rate}₴
'''

INVALID_AMOUNT_TEXT = '⚠️ Введіть правильну суму:'

MENU_BUTTON_TEXT = 'Меню'

CHOOSE_CURRENCY_PLACEHOLDER_TEXT = 'Оберіть валюту..'

# ENTER_AMOUNT_PLACEHOLDER_TEXT = 'Введіть суму в гривнях..'
